In [1]:
%load_ext sql
import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

How many classes taught by each professor

In [3]:
%%sql
SELECT Faculty_Name, COUNT(Cat_ID) AS Classes_Taught
FROM Courses
GROUP BY Faculty_Name
ORDER BY Classes_Taught DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Sonya R.  Huber', 214),
 ('Nicole Elizabeth  Heller', 160),
 ('Sarah Jennie  Bollinger', 131),
 ('TBA', 120),
 ('Laura   Nash', 115),
 ('Kamala   Kiem', 96),
 ('Rose P.  Rodrigues', 74),
 ('Nancy A.  Moriber', 72),
 ('Michael P.  Pagano', 71),
 ('Michael C.  White', 70),
 ('Qin   Zhang', 68),
 ('Philip J.  Lane', 61),
 ('Robert A.  Hardy', 61),
 ('Jeffrey N.  Denenberg', 60),
 ('Amalia I.  Rusu', 59),
 ('Linda A.  Henkel', 59),
 ('Anthony J.  DeCristofaro', 58),
 ('James E.  Biardi', 58),
 ('Bidyut B.  Das', 56),
 ('David W.  McFadden', 56)]

Total students professors have taught

In [4]:
%%sql
SELECT Faculty_Name, SUM(Actual) AS Total_Taught
FROM Courses
WHERE Actual > 10
GROUP BY Faculty_Name
ORDER BY Total_Taught DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Nicole Elizabeth  Heller', 3214),
 ('Kamala   Kiem', 1990),
 ('Diana R.  Mager', 1716),
 ('Anthony J.  DeCristofaro', 1434),
 ('Christine   Earls', 1419),
 ('John E.  Neal', 1199),
 ('Mary M  Murphy', 1132),
 ('Milo W.  Peck', 1088),
 ('Rose P.  Rodrigues', 1087),
 ('Nancy A.  Moriber', 1082),
 ('Katherine Marie  Saracino', 1080),
 ('Paul P.  Daulerio', 1049),
 ('Jo Ann   Drusbosky', 1027),
 ('Eileen   Reilly-Wiedow', 1002),
 ('Bidyut B.  Das', 970),
 ('Michael P.  Pagano', 927),
 ('Sharlene A.  McEvoy', 926),
 ('Lisa A.  Mainiero', 920),
 ('Mary Sallyanne   Ryan', 894),
 ('Todd P.  Martin', 884)]

What days are popular for certain classes

In [5]:
%%sql
SELECT DISTINCT Cat_ID AS Class_Type, Day, COUNT(Day) AS Num_Days
FROM Courses
    JOIN Course_Meeting USING (CRN)
WHERE Actual > 10
GROUP BY Day, Class_Type
ORDER BY Num_Days DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('EN 0012', 'T', 2810),
 ('EN 0012', 'R', 2569),
 ('EN 0012', 'M', 2469),
 ('EN 0012', 'F', 2337),
 ('EN 0011', 'M', 2055),
 ('EN 0011', 'T', 2001),
 ('EN 0011', 'F', 1889),
 ('PH 0101', 'R', 1867),
 ('PH 0101', 'T', 1840),
 ('PH 0101', 'M', 1828),
 ('EN 0011', 'R', 1772),
 ('HI 0010', 'M', 1669),
 ('HI 0010', 'R', 1565),
 ('SP 0111', 'W', 1333),
 ('SP 0210', 'W', 1313),
 ('SP 0210', 'R', 1308),
 ('PH 0101', 'F', 1299),
 ('SP 0210', 'M', 1262),
 ('SP 0111', 'M', 1205),
 ('MA 0217', 'R', 1203)]

What classes are popular with certain professors

Major flaws with capacity and remaining (BI 170, BI 107, AC 11, etc.)

In [6]:
%%sql
SELECT Cat_ID, Faculty_Name, Remaining
FROM Courses
    JOIN Course_Meeting USING (CRN)
ORDER BY Remaining
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75),
 ('BI 0107', 'Anthony J.  DeCristofaro', -75)]

##How many students did internships for credit

In [7]:
%%sql
SELECT Title, Sum(Actual) AS Total_Students
FROM Courses
    JOIN Catalog USING (Cat_ID)
WHERE Title = "Internship"
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Internship', 1158)]

How many students took AC 11 by term

In [8]:
%%sql
SELECT Cat_ID, Term, Sum(Actual) AS Total_Students
FROM Courses
WHERE Cat_ID = "AC 0011"
GROUP BY Term
ORDER BY Total_Students DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('AC 0011', 'Fall2018', 490),
 ('AC 0011', 'Fall2014', 464),
 ('AC 0011', 'Fall2017', 432),
 ('AC 0011', 'Fall2015', 428),
 ('AC 0011', 'Fall2016', 423),
 ('AC 0011', 'Spring2018', 57),
 ('AC 0011', 'Spring2015', 54),
 ('AC 0011', 'Spring2017', 54),
 ('AC 0011', 'Spring2019', 54),
 ('AC 0011', 'Spring2016', 48),
 ('AC 0011', 'Summer2016', 5)]

What class by term has had the most sections

In [9]:
%%sql 
SELECT Cat_ID, Term, COUNT(DISTINCT Section) AS Num_Sections
FROM Courses
GROUP BY Term, Cat_ID
ORDER BY Num_Sections DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('EN 0012', 'Spring2017', 53),
 ('EN 0011', 'Fall2014', 52),
 ('EN 0012', 'Spring2015', 52),
 ('EN 0011', 'Fall2016', 51),
 ('FE 0001', 'Fall2016', 51),
 ('FE 0001', 'Fall2017', 51),
 ('FE 0001', 'Fall2018', 51),
 ('FE 0001', 'Fall2015', 50),
 ('EN 0011', 'Fall2018', 50),
 ('EN 0012', 'Spring2018', 50),
 ('EN 0011', 'Fall2017', 49),
 ('EN 0012', 'Spring2019', 49),
 ('EN 0011', 'Fall2015', 48),
 ('EN 0012', 'Spring2016', 47),
 ('FE 0001', 'Fall2014', 46),
 ('PH 0101', 'Fall2016', 25),
 ('PH 0101', 'Fall2014', 24),
 ('EC 0011', 'Fall2016', 24),
 ('EC 0011', 'Fall2018', 24),
 ('PH 0101', 'Fall2015', 23)]

What classes has Huntley taught by semester

In [10]:
%%sql
SELECT Faculty_Name, Term, Cat_ID, Section
FROM Courses
WHERE Faculty_Name LIKE ("%Huntley%")
ORDER BY Term;

 * sqlite:///CourseData.db
Done.

[('Christopher L.  Huntley', 'Fall2014', 'IS 0100', 'E'),
 ('Christopher L.  Huntley', 'Fall2014', 'IS 0135', 'A'),
 ('Christopher L.  Huntley', 'Fall2014', 'IS 0320', 'A'),
 ('Christopher L.  Huntley', 'Fall2015', 'IS 0100', 'E'),
 ('Christopher L.  Huntley', 'Fall2015', 'IS 0100', 'F'),
 ('Christopher L.  Huntley', 'Fall2015', 'IS 0135', 'A'),
 ('Christopher L.  Huntley', 'Fall2015', 'IS 0320', 'A'),
 ('Christopher L.  Huntley', 'Fall2016', 'IS 0135', '01'),
 ('Christopher L.  Huntley', 'Fall2016', 'IS 0240', '01'),
 ('Christopher L.  Huntley', 'Fall2016', 'IS 0585C', '01'),
 ('Christopher L.  Huntley', 'Fall2017', 'IS 0240', '01'),
 ('Christopher L.  Huntley', 'Fall2017', 'IS 0399', 'CH'),
 ('Christopher L.  Huntley', 'Fall2017', 'IS 0505', '01'),
 ('Christopher L.  Huntley', 'Fall2017', 'IS 0510', '01'),
 ('Christopher L.  Huntley', 'Fall2018', 'BA 0505', '01'),
 ('Christopher L.  Huntley', 'Fall2018', 'OM 0101', '01'),
 ('Christopher L.  Huntley', 'Fall2018', 'OM 0101', '02'),
 ('Christopher L.  Huntley', 'Spring2016', 'IS 0585', '01'),
 ('Christopher L.  Huntley', 'Spring2016', 'OM 0101', 'B'),
 ('Christopher L.  Huntley', 'Spring2016', 'OM 0101', 'C'),
 ('Christopher L.  Huntley', 'Spring2017', 'IS 0240', '01'),
 ('Christopher L.  Huntley', 'Spring2017', 'IS 0320', '01'),
 ('Christopher L.  Huntley', 'Spring2017', 'IS 0399', 'CH'),
 ('Christopher L.  Huntley', 'Spring2017', 'OM 0101', '06'),
 ('Christopher L.  Huntley', 'Spring2018', 'IS 0240', '01'),
 ('Christopher L.  Huntley', 'Spring2018', 'IS 0260', '01'),
 ('Christopher L.  Huntley', 'Spring2018', 'IS 0320', '01'),
 ('Christopher L.  Huntley', 'Spring2018', 'IS 0399', 'CH'),
 ('Christopher L.  Huntley', 'Spring2019', 'BA 0510', '01'),
 ('Christopher L.  Huntley', 'Spring2019', 'OM 0101', '01'),
 ('Christopher L.  Huntley', 'Spring2019', 'OM 0101', '02')]

#What classes has Massey taught by semester

In [11]:
%%sql
SELECT Faculty_Name, Term, Cat_ID, Section
FROM Courses
WHERE Faculty_Name LIKE ("%Massey%")
ORDER BY Term;

 * sqlite:///CourseData.db
Done.

[('Dawn W  Massey', 'Fall2014', 'AC 0570', '03'),
 ('Dawn W  Massey', 'Fall2014', 'AC 0590', '01'),
 ('Dawn W  Massey', 'Fall2014', 'AC 0590', '02'),
 ('Dawn W  Massey', 'Fall2014', 'AC 0590', '03'),
 ('Dawn W  Massey', 'Fall2015', 'AC 0570', '03'),
 ('Dawn W  Massey', 'Fall2015', 'AC 0590', '01'),
 ('Dawn W  Massey', 'Fall2015', 'AC 0590', '02'),
 ('Dawn W  Massey', 'Fall2015', 'AC 0590', '03'),
 ('Dawn W  Massey', 'Fall2016', 'AC 0570', '01'),
 ('Dawn W  Massey', 'Fall2016', 'AC 0570', '02'),
 ('Dawn W  Massey', 'Fall2016', 'AC 0570', '03'),
 ('Dawn W  Massey', 'Fall2016', 'AC 0590', 'DM'),
 ('Dawn W  Massey', 'Fall2018', 'AC 0590', '01'),
 ('Dawn W  Massey', 'Fall2018', 'AC 0590', '02'),
 ('Dawn W  Massey', 'Fall2018', 'AC 0590', '03'),
 ('Dawn W  Massey', 'Fall2018', 'BU 0591', '01'),
 ('Dawn W  Massey', 'Spring2015', 'AC 0011', 'A'),
 ('Dawn W  Massey', 'Spring2015', 'AC 0011', 'B'),
 ('Dawn W  Massey', 'Spring2015', 'AC 0555', '01'),
 ('Dawn W  Massey', 'Spring2016', 'AC 0011', 'A'),
 ('Dawn W  Massey', 'Spring2016', 'AC 0011', 'B'),
 ('Dawn W  Massey', 'Spring2016', 'AC 0555', '01'),
 ('Dawn W  Massey', 'Spring2017', 'AC 0011', '01'),
 ('Dawn W  Massey', 'Spring2017', 'AC 0011', '02'),
 ('Dawn W  Massey', 'Spring2017', 'AC 0398', 'DM'),
 ('Dawn W  Massey', 'Spring2017', 'AC 0555', '01'),
 ('Dawn W  Massey', 'Spring2017', 'AC 0598', 'DM'),
 ('Dawn W  Massey', 'Spring2018', 'BU 0591', '01'),
 ('Dawn W  Massey', 'Spring2019', 'BU 0591', 'DM'),
 ('Dawn W  Massey', 'Summer2016', 'AC 0011', '01'),
 ('Dawn W  Massey', 'Summer2018', 'BU 0591', '01'),
 ('Dawn W  Massey', 'Winter2015', 'AC 0555', '01'),
 ('Dawn W  Massey', 'Winter2016', 'AC 0555', '01')]

In [16]:
%%sql
SELECT DISTINCT Prg_Code, Program_Name
FROM Program
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('AC', 'Accounting'),
 ('AE', 'Applied Ethics'),
 ('AH', 'Art History'),
 ('AN', 'Asian Studies'),
 ('AR', 'Arabic'),
 ('AS', 'American Studies'),
 ('AY', 'Anthropology'),
 ('BB', 'Business'),
 ('BEN', 'Bioengineering'),
 ('BI', 'Biology'),
 ('BL', 'Black Studies'),
 ('BU', 'Business'),
 ('CH', 'Chemistry'),
 ('CI', 'Chinese'),
 ('CL', 'Classical Studies'),
 ('CN', 'Counseling'),
 ('CO', 'Communication'),
 ('CR', 'Computer Engineering'),
 ('CS', 'Computer Science'),
 ('EC', 'Economics')]

In [38]:
%%sql
SELECT Room, COUNT(Room) as Num_Classes
FROM Courses
    JOIN Course_Meeting USING (CRN, Term)
WHERE Faculty_Name LIKE ("%Huntley%")
GROUP BY Room
ORDER BY Num_Classes DESC
LIMIT 100;

 * sqlite:///CourseData.db
Done.

[('DSB 106', 108),
 ('DSB 110B', 105),
 ('DSB 109', 81),
 ('DSB 115', 76),
 ('DSB 114', 52),
 ('DSB 108', 29),
 ('DSB 111', 28),
 ('DSB 112', 27),
 ('DSB 107', 26),
 ('DSB 110A', 26),
 ('DSB 104', 25),
 ('DSB 2109A', 14),
 ('DSB 105', 6)]

In [40]:
%%sql
SELECT Cat_ID, Fee
FROM Fees
WHERE Fee IS NOT NULL
LIMIT 40;

 * sqlite:///CourseData.db
Done.

[('BI 0107', '$55 Science Lab Fee'),
 ('BI 0108', '$55 Science Lab Fee'),
 ('SA 0011', '$55 Materials Fee'),
 ('BI 0151', '$55 Science Lab Fee'),
 ('SA 0012', '$55 Materials Fee'),
 ('SA 0013', '$55 Materials Fee'),
 ('SA 0014', '$55 Materials Fee'),
 ('SA 0015', '$55 Materials Fee'),
 ('SA 0016', '$55 Materials Fee'),
 ('BI 0170', '$55 Science Lab Fee'),
 ('BI 0171', '$55 Science Lab Fee'),
 ('SA 0100', '$55 Materials Fee'),
 ('SA 0101', '$55 Materials Fee'),
 ('BI 0172', '$55 Science Lab Fee'),
 ('SA 0105', '$55 Materials Fee'),
 ('SA 0130', '$55 Materials Fee'),
 ('SA 0132', '$55 Materials Fee'),
 ('SA 0133', '$105 Materials Fee'),
 ('SA 0134', '$105 Materials Fee'),
 ('SA 0136', '$55 Materials Fee'),
 ('SA 0137', '$55 Materials Fee'),
 ('SA 0138', '$55 Materials Fee'),
 ('SA 0139', '$55 Materials Fee'),
 ('SA 0230', '$55 Materials Fee'),
 ('SA 0231', '$55 Materials Fee'),
 ('BI 0218L', '$55 Science Lab Fee'),
 ('SA 0232', '$55 Materials Fee'),
 ('SA 0233', '$55 Materials Fee'),
 ('SA 0235', '$55 Materials Fee'),
 ('SA 0299', '$55 Materials Fee'),
 ('BI 0260', '$55 Science Lab Fee'),
 ('BI 0261', '$55 Science Lab Fee'),
 ('PS 0115L', '$55 Science Lab Fee'),
 ('SA 0301', '$55 Materials Fee'),
 ('BI 0262', '$55 Science Lab Fee'),
 ('BI 0310', '$55 Science Lab Fee'),
 ('PS 0116L', '$55 Science Lab Fee'),
 ('PS 0204L', '$55 Science Lab Fee'),
 ('MU 0060', '$500 Music Lesson Fee'),
 ('BI 0317L', '$55 Science Lab Fee')]